---
kind: enumMember
id: F:Autodesk.Revit.DB.ImageTypeStatus.FailedToLoad
enum: Autodesk.Revit.DB.ImageTypeStatus
source: html/b84b2403-3c15-b917-ec36-7cca79c50c81.htm
---
# Autodesk.Revit.DB.ImageTypeStatus.FailedToLoad

The linked image could not be loaded from file.
 Some possible reasons are:
 The file could not be found The file could be corrupt or not contain image data In case of PDF files, the file might be encrypted or not have the requested page